//Шаблон 7-1
//7 папок- 1 файл
//base - базовые вещи: инпуты, кнопки, константы, цвета
//components - блоки по БЭМу
//layout - колоночки, хедер, футер
//pages - страницы нашего сайта. у нас одна страница, хоть и есть ссылки на другие странички
//themes -темы. переключатель на темную и светлую тему. либо админский или юзерский видэ
//utils - тоже что мы подключаем из сторонних библиотек 
//vendors - можем подключать сюда _normalize.scss, _bootstrap.scss, _jquery-ui.scss, _select2.scss или вещи которые мы подгружаем из сторонних библиотек
// все файлики которые мы не хотим отдельно гененрировать пишутся черех ничжнее подчеркивние
//npm run style
// для блоков марджинов не задаем чтобы они не влияли на окружение
//flex-grow: 1; - РАСТЯНУТЬ элементы по ширине чтобы он занял все оставшееся пространство
